#include <stdio.h>

int main() {
    int S, T, A; // 定义税前工资、税后工资和应纳税所得额

    // 读取税前工资
    do{	
        scanf("%d", &S);
      }while(0!=S%100);
    // 计算应纳税所得额
    A = S - 3500;

    // 根据应纳税所得额计算税后工资
    if (A <= 0) {
        T = S; // 不需要交税
    } else if (A <= 1500) {
        T = S - A * 0.03;
    } else if (A <= 4500) {
        T = S - 1500 * 0.03 - (A - 1500) * 0.10;
    } else if (A <= 9000) {
        T = S - 1500 * 0.03 -3000 * 0.10 - (A - 4500) *0.20;
    } else if (A <= 35000) {
        T = S - 1500 * 0.03 -3000 *0.10 - 4500 *0.20 - (A - 9000) * 0.25;
    } else {
        T = S - 1500 *0.03 - 3000 * 0.10 - 4500 * 0.20 -26000 * 0.25 - (A - 35000) * 0.30;
    }

    // 输出税后工资
    printf("%d\n", T);

    return 0;
}
